&НаКлиенте
Процедура ПриИзмененииКоличествоЦена(Форма, ИмяТаблицы, ЗначениеПустогоКоличества = 0) Экспорт
	Элементы = Форма.Элементы;
	
	СтрокаТаблицы = Элементы[ИмяТаблицы].ТекущиеДанные;
		
	РассчитатьСуммуТабЧасти(СтрокаТаблицы, ЗначениеПустогоКоличества);

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуТабЧасти(СтрокаТаблицы, ЗначениеПустогоКоличества = 0) Экспорт
	СтрокаТабличнойЧасти = СтрокаТаблицы;

	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * ?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество);

КонецПроцедуры